Revit 2027 API
IndexStreamLine.AddLine Method
 Inserts a IndexLine segment into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddLine(
	IndexLine line
)
Public Sub AddLine (
	line As IndexLine
)
public:
void AddLine(
	IndexLine^ line
)
member AddLine :
        line : IndexLine -> unit
Parameters
line IndexLine
 The line segment to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace